vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1187_DFP.pdsc
    <condition id="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT1187xxxxx, boards=evkmimxrt1180a.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="device_ids.MIMXRT1187xxxxx.internal_condition"/>
      <require condition="boards.evkmimxrt1180a.internal_condition"/>
    </condition>
    <condition id="boards.evkmimxrt1180a.internal_condition">
      <accept condition="device.MIMXRT1187.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT1187xxxxx, boards=evkmimxrt1180a.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="device_ids.MIMXRT1187xxxxx.internal_condition"/>
      <require condition="boards.evkmimxrt1180a.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT1187xxxxx, boards=evkmimxrt1180a.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="device_ids.MIMXRT1187xxxxx.internal_condition"/>
      <require condition="boards.evkmimxrt1180a.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1187xxxxx, boards=evkmimxrt1180a.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm7f.internal_condition"/>
      <require condition="device_ids.MIMXRT1187xxxxx.internal_condition"/>
      <require condition="boards.evkmimxrt1180a.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1187xxxxx, boards=evkmimxrt1180a.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm7f.internal_condition"/>
      <require condition="device_ids.MIMXRT1187xxxxx.internal_condition"/>
      <require condition="boards.evkmimxrt1180a.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1187xxxxx, boards=evkmimxrt1180a.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="cores.cm7f.internal_condition"/>
      <require condition="device_ids.MIMXRT1187xxxxx.internal_condition"/>
      <require condition="boards.evkmimxrt1180a.internal_condition"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.device_id=MIMXRT1187xxxxx, CMSIS_Include_core_cm, device.startup, driver.common, driver.clock, driver.rgpio, driver.iomuxc, driver.memory, driver.ele_base_api, driver.dcdc_3, driver.gpc_3, driver.anadig_pmu_1, driver.src_3, driver.misc, device.boot_header, component.lpuart_adapter, utility.debug_console_lite, utility.assert_lite, utility.str, anyOf=driver.cache_armv7_m7, driver.cache_xcache.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MIMXRT1187xxxxx, CMSIS_Include_core_cm, device.startup, driver.common, driver.clock, driver.rgpio, driver.iomuxc, driver.memory, driver.ele_base_api, driver.dcdc_3, driver.gpc_3, driver.anadig_pmu_1, driver.src_3, driver.misc, device.boot_header, component.lpuart_adapter, utility.debug_console_lite, utility.assert_lite, utility.str, anyOf=driver.cache_armv7_m7, driver.cache_xcache.internal_condition">
      <require condition="device_id.MIMXRT1187xxxxx.internal_condition"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iomuxc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="memory"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ele_base_api"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dcdc_soc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpc_3"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pmu_1"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_src"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="misc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="xip_device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="anyOf.driver.cache_armv7_m7, driver.cache_xcache.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_armv7_m7, driver.cache_xcache.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_xcache"/>
    </condition>
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=MIMXRT1187.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=MIMXRT1187.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1187_system"/>
      <require condition="device.MIMXRT1187.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, core_ids=cm33.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="core_ids.cm33.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, core_ids=cm33.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="core_ids.cm33.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk, core_ids=cm33.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="core_ids.cm33.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar, core_ids=cm7.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="core_ids.cm7.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, core_ids=cm7.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="core_ids.cm7.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk, core_ids=cm7.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="core_ids.cm7.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MIMXRT1187.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MIMXRT1187.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1187_header"/>
      <require condition="device.MIMXRT1187.internal_condition"/>
    </condition>
