vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1187_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi" Cversion="2.8.0" condition="driver.flexspi.condition_id">
      <description>FLEXSPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_flexspi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_flexspi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi_edma" Cversion="2.3.3" condition="driver.flexspi_edma.condition_id">
      <description>FLEXSPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_flexspi_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_flexspi_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi_flr" Cversion="2.0.0" condition="driver.flexspi_flr.condition_id">
      <description>FLEXSPI FOLLOWER Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_flexspi_flr.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_flexspi_flr.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxas21002cq" Cversion="1.0.0" condition="driver.fxas21002cq.condition_id">
      <description>Driver fxas21002cq</description>
      <files>
        <file category="header" name="components/sensor/fxas21002cq/fsl_fxas.h" projectpath="gyroscope"/>
        <file category="sourceC" name="components/sensor/fxas21002cq/fsl_fxas.c" projectpath="gyroscope"/>
        <file category="include" name="components/sensor/fxas21002cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxls8974cf" Cversion="1.0.0" condition="driver.fxls8974cf.condition_id">
      <description>Driver fxls8974cf</description>
      <files>
        <file category="header" name="components/sensor/fxls8974cf/fsl_fxls.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/fxls8974cf/fsl_fxls.c" projectpath="accel"/>
        <file category="include" name="components/sensor/fxls8974cf/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxos8700cq" Cversion="1.0.0" condition="driver.fxos8700cq.condition_id">
      <description>Driver fxos8700cq</description>
      <files>
        <file category="header" name="components/sensor/fxos8700cq/fsl_fxos.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/fxos8700cq/fsl_fxos.c" projectpath="accel"/>
        <file category="include" name="components/sensor/fxos8700cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpc_3" Cversion="2.1.0" condition="driver.gpc_3.condition_id">
      <description>GPC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_gpc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_gpc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpt" Cversion="2.0.6" condition="driver.gpt.condition_id">
      <description>GPT Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_gpt.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_gpt.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="htu21d" Cversion="1.0.0" condition="driver.htu21d.condition_id">
      <description>Driver htu21d</description>
      <files>
        <file category="header" name="components/sensor/htu21d/fsl_htu21d.h" projectpath="htu"/>
        <file category="sourceC" name="components/sensor/htu21d/fsl_htu21d.c" projectpath="htu"/>
        <file category="include" name="components/sensor/htu21d/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i3c" Cversion="2.14.2" condition="driver.i3c.condition_id">
      <description>I3C Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_i3c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_i3c.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_edma" Cversion="2.2.10" condition="driver.i3c_edma.condition_id">
      <description>I3C EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_i3c_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_i3c_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="icm42688p" Cversion="1.0.0" condition="driver.icm42688p.condition_id">
      <description>Driver icm42688p</description>
      <files>
        <file category="header" name="components/sensor/icm42688p/fsl_icm42688p.h" projectpath="icm42688p"/>
        <file category="sourceC" name="components/sensor/icm42688p/fsl_icm42688p.c" projectpath="icm42688p"/>
        <file category="include" name="components/sensor/icm42688p/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iee" Cversion="2.1.1" condition="driver.iee.condition_id">
      <description>IEE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_iee.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_iee.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iee_apc" Cversion="2.0.2" condition="driver.iee_apc.condition_id">
      <description>IEE APC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_iee_apc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_iee_apc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iomuxc" Cversion="2.0.0" condition="driver.iomuxc.condition_id">
      <description>IOMUXC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_iomuxc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="kpp" Cversion="2.1.0" condition="driver.kpp.condition_id">
      <description>KPP Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_kpp.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_kpp.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
