vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1187_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="netc_rt1180" Cversion="2.0.0" condition="driver.netc_rt1180.condition_id">
      <description>Driver netc imxrt1180</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_netc_soc.c" projectpath="drivers/netc"/>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_netc_soc.h" projectpath="drivers/netc"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="netc_switch" Cversion="2.8.1" condition="driver.netc_switch.condition_id">
      <description>NETC Switch Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_netc_switch.h" projectpath="drivers/netc"/>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_netc_tag.h" projectpath="drivers/netc"/>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_netc_switch.c" projectpath="drivers/netc"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nmh1000" Cversion="1.0.0" condition="driver.nmh1000.condition_id">
      <description>Driver nmh1000</description>
      <files>
        <file category="header" name="components/sensor/nmh1000/fsl_nmh1000.h" projectpath="nmh1000"/>
        <file category="sourceC" name="components/sensor/nmh1000/fsl_nmh1000.c" projectpath="nmh1000"/>
        <file category="include" name="components/sensor/nmh1000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="p3t1755" Cversion="2.0.0" condition="driver.p3t1755.condition_id">
      <description>Driver p3t1755</description>
      <files>
        <file category="header" name="components/sensor/p3t1755/fsl_p3t1755.h" projectpath="component/p3t1755"/>
        <file category="sourceC" name="components/sensor/p3t1755/fsl_p3t1755.c" projectpath="component/p3t1755"/>
        <file category="include" name="components/sensor/p3t1755/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x" Cversion="2.0.1" condition="driver.pcm186x.condition_id">
      <description>Driver pcm186x</description>
      <RTE_Components_h>
#ifndef CODEC_PCM186X_ENABLE
#define CODEC_PCM186X_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/pcm186x/fsl_pcm186x.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/pcm186x/fsl_pcm186x.c" projectpath="codec"/>
        <file category="include" name="components/codec/pcm186x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x" Cversion="2.0.1" condition="driver.pcm512x.condition_id">
      <description>Driver pcm512x</description>
      <RTE_Components_h>
#ifndef CODEC_PCM512X_ENABLE
#define CODEC_PCM512X_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/pcm512x/fsl_pcm512x.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/pcm512x/fsl_pcm512x.c" projectpath="codec"/>
        <file category="include" name="components/codec/pcm512x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pdm" Cversion="2.9.3" condition="driver.pdm.condition_id">
      <description>PDM Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_pdm.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_pdm.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pdm_edma" Cversion="2.6.4" condition="driver.pdm_edma.condition_id">
      <description>PDM EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_pdm_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_pdm_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf1550" Cversion="1.0.0" condition="driver.pf1550.condition_id">
      <description>Driver pf1550</description>
      <files>
        <file category="sourceC" name="components/pmic/pf1550/fsl_pf1550.c" projectpath="component/pmic/pf1550"/>
        <file category="header" name="components/pmic/pf1550/fsl_pf1550.h" projectpath="component/pmic/pf1550"/>
        <file category="sourceC" name="components/pmic/pf1550/fsl_pf1550_charger.c" projectpath="component/pmic/pf1550"/>
        <file category="header" name="components/pmic/pf1550/fsl_pf1550_charger.h" projectpath="component/pmic/pf1550"/>
        <file category="include" name="components/pmic/pf1550/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf3000" Cversion="1.0.0" condition="driver.pf3000.condition_id">
      <description>Driver pf3000</description>
      <files>
        <file category="sourceC" name="components/pmic/pf3000/fsl_pf3000.c" projectpath="component/pmic/pf3000"/>
        <file category="header" name="components/pmic/pf3000/fsl_pf3000.h" projectpath="component/pmic/pf3000"/>
        <file category="include" name="components/pmic/pf3000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf5020" Cversion="2.0.0" condition="driver.pf5020.condition_id">
      <description>Driver pf5020</description>
      <files>
        <file category="sourceC" name="components/pmic/pf5020/fsl_pf5020.c" projectpath="component/pmic/pf5020"/>
        <file category="header" name="components/pmic/pf5020/fsl_pf5020.h" projectpath="component/pmic/pf5020"/>
        <file category="include" name="components/pmic/pf5020/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm" Cversion="2.9.0" condition="driver.pwm.condition_id">
      <description>PWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_pwm.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_pwm.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="qtmr" Cversion="2.3.0" condition="driver.qtmr_1.condition_id">
      <description>QTMR Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_qtmr.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_qtmr.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.1.0" condition="driver.rgpio.condition_id">
      <description>RGPIO Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1187/drivers/fsl_rgpio.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1187/drivers/fsl_rgpio.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1187/drivers/"/>
      </files>
    </component>
